InformationRegisters/ИсторияКадровогоРезерва.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИсторияКадровогоРезерва</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияСогласования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидРезерва</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКадровогоРезерва</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Наставник</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УчастникПроцессаНаставничества</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Куратор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОснованияКадровогоРезерва</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПозицияРезерва</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КадровыйРезерв</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УчастникКадровогоРезерва</Name>
					<Comment>АПК:58 - в синониме  используется общепринятый термин</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УчастникКадровогоРезерва</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СтатусыГотовностиРезервистов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СтатусыГотовностиРезервистов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыГотовностиРезервистов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПозицияРезерва</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КадровыйРезерв</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УчастникКадровогоРезерва</Name>
					<Comment>АПК:58 - в синониме  используется общепринятый термин</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УчастникКадровогоРезерва</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СостоянияСогласования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СостоянияСогласования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отклонено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рассматривается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласовано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Готовится</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исполнена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапланированоОбучение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗаявкаНаВключениеВКадровыйРезерв.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ЗаявкаНаВключениеВКадровыйРезерв</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ИсторияКадровогоРезерва</xr:Item>
				<xr:Item>InformationRegister.УдалитьИсторияКадровогоРезерва</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРезерва</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКадровогоРезерва</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПозицияРезерва</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КадровыйРезерв</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчастникКадровогоРезерва</Name>
					<Comment>АПК:58 - в имени используется общепринятое сокращение</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УчастникКадровогоРезерва</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыдвижения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наставник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Куратор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonForms/КадровыйРезерв/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ДобавитьКомандыФормыКадровогоРезерва(Параметры.УчастникКадровогоРезерва) Тогда
		КадровыйРезервФормы.СоздатьКомандыФормыКадровогоРезерва(ЭтотОбъект);
		КадровыйРезервФормы.СоздатьЭлементыФормыКомандыКадровогоРезерва(ЭтотОбъект, Элементы.КоманднаяПанельФормы);
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры, "УчастникКадровогоРезерва");
	Заголовок = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(УчастникКадровогоРезерва, "Наименование");
	
	ПараметрПодразделение = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "Подразделение");
	Если ТипЗнч(ПараметрПодразделение) = Тип("СправочникСсылка.СтруктураПредприятия") Тогда
		Подразделение = ПараметрПодразделение;
	ИначеЕсли ТипЗнч(ПараметрПодразделение) = Тип("СправочникСсылка.ПодразделенияОрганизаций") Тогда
		Подразделение = ОрганизационнаяСтруктура.ПодразделениеВСтруктуреПредприятия(ПараметрПодразделение);
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ИсторияКадровогоРезерва,
		"УчастникКадровогоРезерва", Параметры.УчастникКадровогоРезерва);
	
	СоздатьЭлементыФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подключаемый_ЗаявкаНаВключениеВКадровыйРезерв(Команда)
	
	ПараметрыФормы = Новый Структура("УчастникКадровогоРезерва", УчастникКадровогоРезерва);
	ОткрытьФорму("Документ.ЗаявкаНаВключениеВКадровыйРезерв.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект,
		Новый УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВключениеВКадровыйРезерв(Команда)
	
	ПараметрыФормы = Новый Структура("УчастникКадровогоРезерва, Подразделение", УчастникКадровогоРезерва, Подразделение);
	КадровыйРезервКлиент.ОткрытьФормуВключениеВКадровыйРезерв(ЭтотОбъект, ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ИсключениеИзКадровогоРезерва(Команда)
	
	ПараметрыФормы = Новый Структура("УчастникКадровогоРезерва", УчастникКадровогоРезерва);
	КадровыйРезервКлиент.ОткрытьФормуИсключениеИзКадровогоРезерва(ЭтотОбъект, ПараметрыФормы);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ДобавитьКомандыФормыКадровогоРезерва(УчастникКадровогоРезерва)
	
	Результат = Истина;
	
	Если ТипЗнч(УчастникКадровогоРезерва) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		Сотрудники = КадровыйУчет.СотрудникиФизическихЛиц(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
			УчастникКадровогоРезерва));
		Результат = ЗначениеЗаполнено(Сотрудники);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура СоздатьЭлементыФормы()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("УчастникКадровогоРезерва", УчастникКадровогоРезерва);
	Запрос.УстановитьПараметр("СтатусИсключен", ПредопределенноеЗначение("Перечисление.СостоянияСогласования.ПустаяСсылка"));
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИсторияКадровогоРезерва.ВидРезерва КАК ВидРезерва,
	|	ИсторияКадровогоРезерва.ПозицияРезерва КАК ПозицияРезерва,
	|	ИсторияКадровогоРезерва.УчастникКадровогоРезерва КАК УчастникКадровогоРезерва,
	|	ИсторияКадровогоРезерва.Статус КАК Статус,
	|	НАЧАЛОПЕРИОДА(ИсторияКадровогоРезерва.Период, ДЕНЬ) КАК ДатаВключения,
	|	ИсторияКадровогоРезерва.ДатаОкончания КАК ДатаИсключения,
	|	ИсторияКадровогоРезерва.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрСведений.ИсторияКадровогоРезерва КАК ИсторияКадровогоРезерва
	|ГДЕ
	|	ИсторияКадровогоРезерва.УчастникКадровогоРезерва = &УчастникКадровогоРезерва
	|	И ИсторияКадровогоРезерва.Статус <> &СтатусИсключен
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаВключения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИсторияКадровогоРезерва.ПозицияРезерва КАК ПозицияРезерва,
	|	ИсторияКадровогоРезерва.УчастникКадровогоРезерва КАК УчастникКадровогоРезерва,
	|	НАЧАЛОПЕРИОДА(ИсторияКадровогоРезерва.Период, ДЕНЬ) КАК ДатаИсключения,
	|	ИсторияКадровогоРезерва.ВидРезерва КАК ВидРезерва
	|ИЗ
	|	РегистрСведений.ИсторияКадровогоРезерва КАК ИсторияКадровогоРезерва
	|ГДЕ
	|	ИсторияКадровогоРезерва.УчастникКадровогоРезерва = &УчастникКадровогоРезерва
	|	И ИсторияКадровогоРезерва.Статус = &СтатусИсключен
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаИсключения";
	Результат = Запрос.ВыполнитьПакет();
	ВключениеВКадровыйРезерв = Результат[0].Выгрузить();
	ИсключениеИзКадровогоРезерва = Результат[1].Выгрузить();
	
	ВспомогательнаяТаблица = ВключениеВКадровыйРезерв.СкопироватьКолонки();
	
	СтруктураПоиска = Новый Структура("ПозицияРезерва,УчастникКадровогоРезерва,ВидРезерва");
	
	Для Каждого СтрокаВключенияВКадровыйРезерв Из ВключениеВКадровыйРезерв Цикл 
		СтрокаКадровогоРезерва = ВспомогательнаяТаблица.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаКадровогоРезерва, СтрокаВключенияВКадровыйРезерв);
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаВключенияВКадровыйРезерв);
		СтрокиИсключенияИзКадровогоРезерва = ИсключениеИзКадровогоРезерва.НайтиСтроки(СтруктураПоиска);
		Если СтрокиИсключенияИзКадровогоРезерва.Количество() > 0 Тогда
			Для Каждого СтрокаИсключенияИзКадровогоРезерва Из СтрокиИсключенияИзКадровогоРезерва Цикл
				Если СтрокаИсключенияИзКадровогоРезерва.ДатаИсключения >= СтрокаВключенияВКадровыйРезерв.ДатаВключения Тогда 
					СтрокаКадровогоРезерва.ДатаИсключения = СтрокаИсключенияИзКадровогоРезерва.ДатаИсключения;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Запрос.УстановитьПараметр("КадровыйРезерв", ВспомогательнаяТаблица);
	
	Запрос.Текст =	
	"ВЫБРАТЬ
	|	КадровыйРезерв.ПозицияРезерва КАК ПозицияРезерва,
	|	КадровыйРезерв.УчастникКадровогоРезерва КАК УчастникКадровогоРезерва,
	|	КадровыйРезерв.Статус КАК Статус,
	|	КадровыйРезерв.ВидРезерва КАК ВидРезерва,
	|	КадровыйРезерв.ДатаВключения КАК ДатаВключения,
	|	КадровыйРезерв.ДатаИсключения КАК ДатаИсключения,
	|	КадровыйРезерв.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ВТКадровыйРезерв
	|ИЗ
	|	&КадровыйРезерв КАК КадровыйРезерв
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтатусыРезервистовСрезПоследних.ПозицияРезерва КАК ПозицияРезерва,
	|	СтатусыРезервистовСрезПоследних.УчастникКадровогоРезерва КАК УчастникКадровогоРезерва,
	|	СтатусыРезервистовСрезПоследних.Статус КАК Статус,
	|	СтатусыРезервистовСрезПоследних.Период КАК СтатусПериод
	|ПОМЕСТИТЬ ВТАктуальныеСтатусы
	|ИЗ
	|	РегистрСведений.СтатусыГотовностиРезервистов.СрезПоследних КАК СтатусыРезервистовСрезПоследних
	|ГДЕ
	|	СтатусыРезервистовСрезПоследних.УчастникКадровогоРезерва = &УчастникКадровогоРезерва
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КадровыйРезерв.ВидРезерва КАК ВидРезерва,
	|	КадровыйРезерв.ПозицияРезерва КАК ПозицияРезерва,
	|	КадровыйРезерв.Статус КАК Статус,
	|	ВЫБОР
	|		КОГДА КадровыйРезерв.ДатаИсключения < &ТекущаяДата
	|				И КадровыйРезерв.ДатаИсключения > ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА 3
	|		КОГДА КадровыйРезерв.Статус = ЗНАЧЕНИЕ(Перечисление.СостоянияСогласования.ПустаяСсылка)
	|			ТОГДА 3
	|		КОГДА КадровыйРезерв.Статус = ЗНАЧЕНИЕ(Перечисление.СостоянияСогласования.Рассматривается)
	|			ТОГДА 2
	|		КОГДА КадровыйРезерв.Статус = ЗНАЧЕНИЕ(Перечисление.СостоянияСогласования.Согласовано)
	|			ТОГДА 1
	|	КОНЕЦ КАК ПриоритетСтатуса,
	|	КадровыйРезерв.ДатаВключения КАК ДатаВключения,
	|	КадровыйРезерв.ДатаИсключения КАК ДатаИсключения,
	|	ВЫРАЗИТЬ(КадровыйРезерв.ПозицияРезерва КАК Справочник.КадровыйРезерв).Представление КАК ПозицияРезерваПредставление,
	|	АктуальныеСтатусы.Статус КАК СтатусРезервиста,
	|	АктуальныеСтатусы.СтатусПериод КАК СтатусРезервистаПериод,
	|	КадровыйРезерв.Регистратор КАК Регистратор,
	|	КадровыйРезерв.Статус КАК СтатусДоИсключения
	|ИЗ
	|	ВТКадровыйРезерв КАК КадровыйРезерв
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТАктуальныеСтатусы КАК АктуальныеСтатусы
	|		ПО КадровыйРезерв.УчастникКадровогоРезерва = АктуальныеСтатусы.УчастникКадровогоРезерва
	|			И КадровыйРезерв.ПозицияРезерва = АктуальныеСтатусы.ПозицияРезерва
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияКадровогоРезерва КАК ИсторияКадровогоРезерва
	|		ПО КадровыйРезерв.ПозицияРезерва = ИсторияКадровогоРезерва.ПозицияРезерва
	|			И КадровыйРезерв.УчастникКадровогоРезерва = ИсторияКадровогоРезерва.УчастникКадровогоРезерва
	|			И КадровыйРезерв.ВидРезерва = ИсторияКадровогоРезерва.ВидРезерва
	|			И (НАЧАЛОПЕРИОДА(КадровыйРезерв.ДатаВключения, ДЕНЬ) = НАЧАЛОПЕРИОДА(ИсторияКадровогоРезерва.Период, ДЕНЬ))
	|			И КадровыйРезерв.Статус = ИсторияКадровогоРезерва.Статус
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПриоритетСтатуса
	|ИТОГИ ПО
	|	ВидРезерва,
	|	ПриоритетСтатуса";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		СоздатьПоясняющуюНадписьОтсутствия();
	Иначе
		СоздатьЭлементыРезерва(РезультатЗапроса);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьЭлементыРезерва(РезультатЗапроса)

	НомерПозицииРезерва = 0;
	ВыборкаВидРезерва = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаВидРезерва.Следующий() Цикл
		ГруппаВидаСоздана = Ложь;
		ВыборкаПриоритетСтатуса= ВыборкаВидРезерва.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПриоритетСтатуса.Следующий() Цикл
			Если ВыборкаПриоритетСтатуса.ПриоритетСтатуса = 3 Тогда
				ГруппаВидРезерва = Элементы.ГруппаЭлементовКадровогоРезерваРанееСостоял
			ИначеЕсли Не ГруппаВидаСоздана Тогда
				НаименованиеГруппы = "ГруппаПозицииРезерва" + НомерПозицииРезерва;
				ГруппаВидРезерва = ГруппаЭлементыФормыДляПозицииРезерва(ЭтотОбъект, НаименованиеГруппы,
					ВыборкаПриоритетСтатуса.ВидРезерва, Элементы.ГруппаЭлементовКадровогоРезерва);
				ГруппаВидаСоздана = Истина;
			КонецЕсли;
			ВыборкаРезультатаЗапроса = ВыборкаПриоритетСтатуса.Выбрать();
			Пока ВыборкаРезультатаЗапроса.Следующий() Цикл
				ДобавитьРеквизитыФормыДляПозицииРезерва(ЭтотОбъект, ВыборкаРезультатаЗапроса, НомерПозицииРезерва);
				ДобавитьЭлементыФормыДляПозицииРезерва(ЭтотОбъект, ГруппаВидРезерва, НомерПозицииРезерва,
					ВыборкаРезультатаЗапроса);
				НомерПозицииРезерва = НомерПозицииРезерва + 1;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьРеквизитыФормыДляПозицииРезерва(Форма, Выборка, ПорядковыйНомер)

	ДобавляемыеРеквизиты = Новый Массив;
	ПорядковыйНомерСтрокой = Формат(ПорядковыйНомер, "ЧН=; ЧГ=;");
	РеквизитВидРезерва = Новый РеквизитФормы("НадписьРезерва" + ПорядковыйНомерСтрокой,
		Новый ОписаниеТипов("ФорматированнаяСтрока"));
	ДобавляемыеРеквизиты.Добавить(РеквизитВидРезерва);
	
	МассивИменРеквизитовФормы = Новый Массив;
	ЗарплатаКадры.ЗаполнитьМассивИменРеквизитовФормы(Форма, МассивИменРеквизитовФормы);
	ЗарплатаКадры.ИзменитьРеквизитыФормы(Форма, ДобавляемыеРеквизиты, МассивИменРеквизитовФормы);
	
	Форма["НадписьРезерва" + ПорядковыйНомерСтрокой] = СобратьФорматированнуюСтрокуРезерва(Выборка);
	
КонецПроцедуры

&НаСервере
Функция СобратьФорматированнуюСтрокуРезерва(Выборка)

	СтатусКандидат = ПредопределенноеЗначение("Перечисление.СостоянияСогласования.Рассматривается");
	СтатусРезервист = ПредопределенноеЗначение("Перечисление.СостоянияСогласования.Согласовано");
	
	МассивСтрок = Новый Массив;
	
	Если Выборка.ПриоритетСтатуса = 3 Тогда
		Если Выборка.СтатусДоИсключения = СтатусКандидат Тогда
			// Был исключен из резервистов.
			МассивСтрок.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'Ранее состоял в'") + " "));
		ИначеЕсли Выборка.СтатусДоИсключения = СтатусРезервист Тогда
			// Был исключен из кандидатов.
			МассивСтрок.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'Рассматривался на позицию'") + " "));
		КонецЕсли;
	ИначеЕсли Выборка.ПриоритетСтатуса = 2 Тогда
		// Если кандидат - укажем пояснение.
		МассивСтрок.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'Кандидат в'") + " "));
	КонецЕсли;
	
	// Добавим описание позиции.
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока(Выборка.ПозицияРезерваПредставление,,,,
		ПолучитьНавигационнуюСсылку(Выборка.ПозицияРезерва)));
	
	// Добавим описание времени.
	Если Выборка.ПриоритетСтатуса = 1 Или Выборка.ПриоритетСтатуса = 2 Тогда
		// Включен, собираем с датой начала (подробной).
		ДанныеСтажа = ЗарплатаКадрыРасширенныйКлиентСервер.СведенияОСтаже();
		ДанныеСтажа.ДатаОтсчета = Выборка.ДатаВключения;
		СтажНаПозицииРезерва = ЗарплатаКадрыРасширенныйКлиентСервер.ПродолжительностьСтажа(ДанныеСтажа,
			ТекущаяДатаСеанса());
		Если СтажНаПозицииРезерва.Лет = 0 И СтажНаПозицииРезерва.Месяцев = 0 Тогда
			ПредставлениеСтажа = ЗарплатаКадрыРасширенныйКлиентСервер.ПредставлениеСтажа(0,	0, СтажНаПозицииРезерва.Дней);
		Иначе
			ПредставлениеСтажа = ЗарплатаКадрыРасширенныйКлиентСервер.ПредставлениеСтажа(СтажНаПозицииРезерва.Лет,
				СтажНаПозицииРезерва.Месяцев, 0);
		КонецЕсли;
		СтрокаВремени = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(" " + НСтр("ru = 'с %1 (%2)'")
			+ " ", Формат(Выборка.ДатаВключения, "ДЛФ=D"), ПредставлениеСтажа);
		МассивСтрок.Добавить(Новый ФорматированнаяСтрока(СтрокаВремени));
	ИначеЕсли Выборка.ПриоритетСтатуса = 3 Тогда
		// Исключен, собираем с датами начала и окончания.
		Если Выборка.СтатусДоИсключения = СтатусРезервист Тогда
			СтрокаВремени = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				" " + НСтр("ru = 'с %1 по %2'") + " ", Формат(Выборка.ДатаВключения, "ДЛФ=D"),
				Формат(Выборка.ДатаИсключения, "ДЛФ=D"));
		ИначеЕсли Выборка.СтатусДоИсключения = СтатусКандидат Тогда
			СтрокаВремени = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				", " + НСтр("ru = 'отклонен %1'") + " ", Формат(Выборка.ДатаИсключения, "ДЛФ=D"));
		КонецЕсли;
		МассивСтрок.Добавить(Новый ФорматированнаяСтрока(СтрокаВремени));
	КонецЕсли;
	
	Если Выборка.ПриоритетСтатуса = 1 Тогда
		МассивСтрок.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'статус:'") + " " + Выборка.СтатусРезервиста
			+ " с " + Формат(Выборка.СтатусРезервистаПериод, "ДЛФ=D")));
	КонецЕсли;
	
	Если Выборка.ПриоритетСтатуса = 1 Или Выборка.ПриоритетСтатуса = 2 Тогда
		Если ЗначениеЗаполнено(Выборка.Регистратор) Тогда
			МассивСтрок.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = ' Основание:'") + Символы.НПП));
			МассивСтрок.Добавить(Новый ФорматированнаяСтрока(Строка(Выборка.Регистратор),,,,
				ПолучитьНавигационнуюСсылку(Выборка.Регистратор)));
		КонецЕсли;
	КонецЕсли;
	
	Возврат Новый ФорматированнаяСтрока(МассивСтрок);

КонецФункции

&НаСервере
Функция ГруппаЭлементыФормыДляПозицииРезерва(Форма, Имя, Заголовок, ГруппаВладелец)

	ГруппаФормы = Форма.Элементы.Вставить(Имя, Тип("ГруппаФормы"), ГруппаВладелец);
	ГруппаФормы.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаФормы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ГруппаФормы.ОтображатьЗаголовок = ПолучитьФункциональнуюОпцию("ИспользоватьКадровыйРезервПоВидам");
	ГруппаФормы.Заголовок = Заголовок;
	ГруппаФормы.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаФормы.РастягиватьПоВертикали = Ложь;
	ГруппаФормы.РастягиватьПоГоризонтали = Ложь;
	
	Возврат ГруппаФормы;
	
КонецФункции
	
&НаСервере
Процедура ДобавитьЭлементыФормыДляПозицииРезерва(Форма, ГруппаФормы, ПорядковыйНомер, Выборка)
	
	ПорядковыйНомерСтрокой = Формат(ПорядковыйНомер, "ЧН=; ЧГ=;");
	
	// Создаем ПозицияРезерва
	ПолеПозицияРезерва = Форма.Элементы.Вставить("НадписьРезерва" + ПорядковыйНомерСтрокой, Тип("ПолеФормы"), ГруппаФормы);
	ПолеПозицияРезерва.ПутьКДанным = "НадписьРезерва" + ПорядковыйНомерСтрокой;
	ПолеПозицияРезерва.Вид = ВидПоляФормы.ПолеНадписи;
	ПолеПозицияРезерва.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	ПолеПозицияРезерва.РастягиватьПоГоризонтали = Истина;
	ПолеПозицияРезерва.Ширина = 200;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьПоясняющуюНадписьОтсутствия()

	// Создаем реквизит формы.
	ДобавляемыеРеквизиты = Новый Массив;
	РеквизитИнфоНадписьНеСостоит = Новый РеквизитФормы("ИнфоНадписьНеСостоит", Новый ОписаниеТипов("Строка"));
	ДобавляемыеРеквизиты.Добавить(РеквизитИнфоНадписьНеСостоит);
	
	МассивИменРеквизитовФормы = Новый Массив;
	ЗарплатаКадры.ЗаполнитьМассивИменРеквизитовФормы(ЭтотОбъект, МассивИменРеквизитовФормы);
	ЗарплатаКадры.ИзменитьРеквизитыФормы(ЭтотОбъект, ДобавляемыеРеквизиты, МассивИменРеквизитовФормы);
	
	ЭтотОбъект.ИнфоНадписьНеСостоит = НСтр("ru = 'Не состоит в кадровом резерве.'");
	
	// Создаем элемент формы.
	ПолеПозицияРезерва = Элементы.Вставить("ИнфоНадписьНеСостоит", Тип("ПолеФормы"),
		Элементы.ГруппаЭлементовКадровогоРезерва);
	ПолеПозицияРезерва.ПутьКДанным = "ИнфоНадписьНеСостоит";
	ПолеПозицияРезерва.Вид = ВидПоляФормы.ПолеНадписи;
	ПолеПозицияРезерва.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	ПолеПозицияРезерва.РастягиватьПоГоризонтали = Истина;
	ПолеПозицияРезерва.Ширина = 200;

КонецПроцедуры

#КонецОбласти
